{

    "main" : {
        "selfIntro" : " I am Jin Hung Chin, a Computer and Information System graduate with approximately 2.5 years of academic programming experience. Capable of developing Frontend and Backend applications or performing full stack MERN development.",
        "background" : " I used to be a Formation Evaluation Geologist and Project Coordinator working in Oil and Gas sector for 7 years. Over the years of working, I have been dealing with tons of operation data daily which then lead me towards the path of SQL programming. Since then, my interest in programming starts to grow and have been learning programming on my own. \nCovid outbreak in 2020 bestowed me with an opportunity to learn programming systematically. I enrolled in Computing and System Information with Douglas College and have graduated recently. Now, I am ready to start on my journey in the programming world.  "
    },

    "resume" :{
        "education" : [
            {
            "eduInst" : "Douglas College , BC Canada",
            "course" : "Post Baccalaureate Diploma Computing and Information System - Emerging Technology",
            "year" : "January 2021 - December 2022"
            },
            {
            "eduInst" : "Curtin University, Perth Australia",
            "course" : "Bachelor of Science Applied Geology - Petroleum Stream",
            "year" : "March 2010 - November 2013"
            }
        ],
        "work" : [
            {
                "company" : "Douglas College",
                "position" : "CSIS Student Assistant",
                "year" : "January 2022 - recent",
                "desc" :  ["Supporting instructors in class by helping out students with questions.", 
                "Mentor and guide students on their labs or assignments in open lab sessions."]
            },
            {
                "company" : "Letong Fibre Technology Sdn Bhd",
                "position" : "Project Coordinator",
                "year" : "July 2017 - December 2020",
                "desc" :  ["Acting as project liaison and working with international oil and gas company to customize product in meeting clients requirement.", 
                "Research and assist the upgrading of company products to meet market demands.", 
                "Leading team to carry out maintenance operations on offshore platforms."]
            },
            {
                "company" : "DHI Services Sdn Bhd",
                "position" : "Formation Evaluation Geologist",
                "year" : "April 2014 - June 2017",
                "desc" :  ["Monitor drilling operations, parameters and pit activities.", 
                "Monitor and analyse the type of gases during well drilling operations. ", 
                "Process real time data in correlation with MWD and provide lithology interpretations for clients."]
            }

        ],
        "projects" : [
            {
                "projectName" : "Canine Life Matter",
                "description" : "Full stack web development project using React, Spring MVC, Node Js, mySQL and integration with several APIs such as RESTful API, GoogleMap API, Payment API etc.",
                "gitUrl": "https://github.com/JinChin02/CanineLifeMatter.git"
                
            },
            {
                "projectName" : "Hack Hunt",
                "description" : "A mobile application developement project developed using Android Studio integrating with AWS Parse server database, and local SQLite database.",
                "gitUrl": "https://github.com/ariayingdeng/F21G2_HackHunt.git"
            },
        
            {
                "projectName" : "Morph",
                "description" : "A web developement project developed on top of Springboot integrating with Spring MVC architecture, H2 database, RESTful API along with GitHub to achieve agile development strategy.",
                "gitUrl": "https://github.com/ariayingdeng/ProjectMorph.git"
            },
        
            {
                "projectName" : "Tim Star",
                "description" : "A web application developed with vanilla HTML, CSS and Javascript",
                "gitUrl": "https://github.com/JinChin02/1280_TravelProject.git"
            }
        ]
    }


}
