{
  "main": {
    "selfIntro": " I'm Jin Hung Chin, transitioning from a Geologist to a Computer and Information Systems graduate. My passion for programming and hands-on experience in front-end and full-stack MERN development, combined with my formal education from Douglas College, have prepared me to contribute effectively in the realm of application development.",
    "background": " I began my professional journey as a Formation Evaluation Geologist in the Oil and Gas sector, where my role involved the daily management of significant operational data. This experience sparked my initial interest in SQL programming, and later leading me to delve into other programming languages. Over time, my fascination with coding grew, and I started to independently study and enhance my programming skills. \nFortuitously, I was given an opportunity to explore this passion further by joining a company as a Front End Developer. This role allowed me to utilize my newly-acquired skills in a practical environment, but I knew I wanted to delve deeper and solidify my theoretical understanding. \nWhen the Covid-19 pandemic broke out in 2020, it offered an unexpected opportunity to further my education. I seized this chance to systematically learn programming, enrolling in the Computing and System Information course at Douglas College. Recently, I celebrated my graduation and now, equipped with both practical experience and formal education, I am eagerly anticipating my journey ahead in the world of programming. \nI am now transformed from a Geologist who knew little about coding, to a full-fledged programmer ready to make my mark in the tech industry.  "
  },

  "resume": {
    "education": [
      {
        "eduInst": "Douglas College , BC Canada",
        "course": "Post Baccalaureate Diploma Computing and Information System - Emerging Technology",
        "year": "January 2021 - December 2022"
      },
      {
        "eduInst": "Curtin University, Perth Australia",
        "course": "Bachelor of Science Applied Geology - Petroleum Stream",
        "year": "March 2010 - November 2013"
      }
    ],
    "work": [
      {
        "company": "Empowered Futures",
        "position": "Web Developer",
        "year": "December 2022 - August 2023",
        "desc": [
          "Design, execute and develop web application along with product manager, developers in an agile manner.",
          "Develop application features with HTML, Bootstrap, ReactJs, ExpressJs, Node.Js, and MongoDB.",
          "Constant review of code to ensure code consistency and reliability while at the same time meeting industry standards."
        ]
      },
      {
        "company": "Douglas College",
        "position": "CSIS Student Assistant",
        "year": "January 2022 - December 2022",
        "desc": [
          "Supporting instructors in class by helping out students with questions.",
          "Mentor and guide students on their labs or assignments in open lab sessions."
        ]
      },
      {
        "company": "Letong Fibre Technology",
        "position": "Project Coordinator",
        "year": "July 2018 - December 2020",
        "desc": [
          "Liaised between the company and an international oil company, facilitating improved communication and operations.",
          "Utilized CAD software to create 3D models, contributing to effective product presentations.",
          "Spearheaded research initiatives that led to product enhancements, increasing market competitiveness by 15%."
        ]
      },
      {
        "company": "DHI Services",
        "position": "Formation Evaluation Geologist",
        "year": "April 2014 - June 2018",
        "desc": [
          "Monitor drilling operations, parameters and pit activities.",
          "Monitor and analyse the type of gases during well drilling operations. ",
          "Process real time data in correlation with MWD and provide lithology interpretations for clients."
        ]
      }
    ],
    "projects": [
      {
        "projectName": "Canine Life Matter",
        "description": "Full stack web development project using React, Springboot, Node Js, mySQL and integration with several APIs such as RESTful API, GoogleMap API, Payment API etc.",
        "gitUrl": "https://github.com/JinChin02/CanineLifeMatter.git"
      },
      {
        "projectName": "Hack Hunt",
        "description": "A mobile application developement project developed using Android Studio integrating with AWS Parse server database, and local SQLite database.",
        "gitUrl": "https://github.com/ariayingdeng/F21G2_HackHunt.git"
      },

      {
        "projectName": "Morph",
        "description": "A web developement project developed on top of Springboot integrating with Spring MVC architecture, H2 database, RESTful API along with GitHub to achieve agile development strategy.",
        "gitUrl": "https://github.com/ariayingdeng/ProjectMorph.git"
      },

      {
        "projectName": "Tim Star",
        "description": "A web application developed with vanilla HTML, CSS and Javascript",
        "gitUrl": "https://github.com/JinChin02/1280_TravelProject.git"
      }
    ]
  }
}
